# Data type Transformation

In [3]:
import pandas as pd 
df=pd.read_csv("Online Sales Data.csv")
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001.0,01-01-2024,NaN,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002.0,02-01-2024,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003.0,03-01-2024,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004.0,04-01-2024,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005.0,05-01-2024,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    239 non-null    float64
 1   Date              240 non-null    object
 2   Product Category  236 non-null    object
 3   Product Name      239 non-null    object
 4   Units Sold        238 non-null    object
 5   Unit Price        238 non-null    float64
 6   Total Revenue     239 non-null    float64
 7   Region            238 non-null    object
 8   Payment Method    239 non-null    object
dtypes: float64(3), object(6)
memory usage: 17.0+ KB

In [5]:
df.isnull().sum()

Transaction ID      1
Date                0
Product Category    4
Product Name        1
Units Sold          2
Unit Price          2
Total Revenue       1
Region              2
Payment Method      1
dtype: int64

In [9]:
df["Units Sold"].value_counts()
# here addd is categorial data

Units Sold
1      96
2      63
3      44
4      22
5       7
6       4
add     1
10      1
Name: count, dtype: int64

In [11]:
df["Units Sold"].fillna(df["Units Sold"].mode()[0],inplace=True)
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001.0,01-01-2024,NaN,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002.0,02-01-2024,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003.0,03-01-2024,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004.0,04-01-2024,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005.0,05-01-2024,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236.0,23-08-2024,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237.0,24-08-2024,NaN,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238.0,25-08-2024,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239.0,26-08-2024,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240.0,27-08-2024,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [12]:
df.isnull().sum()

Transaction ID      1
Date                0
Product Category    4
Product Name        1
Units Sold          0
Unit Price          2
Total Revenue       1
Region              2
Payment Method      1
dtype: int64

In [13]:
df["Units Sold"].value_counts()

Units Sold
1      98
2      63
3      44
4      22
5       7
6       4
add     1
10      1
Name: count, dtype: int64

In [15]:
df["Units Sold"].replace("add","3",inplace=True)
df["Units Sold"].value_counts()

Units Sold
1     98
2     63
3     45
4     22
5      7
6      4
10     1
Name: count, dtype: int64

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    239 non-null    float64
 1   Date              240 non-null    object
 2   Product Category  236 non-null    object
 3   Product Name      239 non-null    object
 4   Units Sold        240 non-null    object
 5   Unit Price        238 non-null    float64
 6   Total Revenue     239 non-null    float64
 7   Region            238 non-null    object
 8   Payment Method    239 non-null    object
dtypes: float64(3), object(6)
memory usage: 17.0+ KB

In [20]:
# 4   Units Sold        240 non-null    object
# convert this datatype to integer 

df["df_replace"]=df["Units Sold"].astype("int64")

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    239 non-null    float64
 1   Date              240 non-null    object
 2   Product Category  236 non-null    object
 3   Product Name      239 non-null    object
 4   Units Sold        240 non-null    object
 5   Unit Price        238 non-null    float64
 6   Total Revenue     239 non-null    float64
 7   Region            238 non-null    object
 8   Payment Method    239 non-null    object
 9   df_replace        240 non-null    int64
dtypes: float64(3), int64(1), object(6)
memory usage: 18.9+ KB